jmeter-test/jmeter.log
2025-07-31 22:31:23,211 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2025-07-31 22:31:23,221 INFO o.a.j.JMeter: Loading user properties from: /workspace/jmeter/bin/user.properties
2025-07-31 22:31:23,221 INFO o.a.j.JMeter: Loading system properties from: /workspace/jmeter/bin/system.properties
2025-07-31 22:31:23,221 INFO o.a.j.JMeter: Setting JMeter property: domain=https://dev.melpotapp.de
2025-07-31 22:31:23,221 INFO o.a.j.JMeter: Setting JMeter property: username=odin
2025-07-31 22:31:23,221 INFO o.a.j.JMeter: Setting JMeter property: password=1234
2025-07-31 22:31:23,221 INFO o.a.j.JMeter: Setting JMeter property: threads=2
2025-07-31 22:31:23,221 INFO o.a.j.JMeter: Setting JMeter property: duration=30
2025-07-31 22:31:23,224 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2025-07-31 22:31:23,224 INFO o.a.j.JMeter: Version 5.6.3
2025-07-31 22:31:23,224 INFO o.a.j.JMeter: java.version=21.0.7
2025-07-31 22:31:23,225 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2025-07-31 22:31:23,225 INFO o.a.j.JMeter: os.name=Linux
2025-07-31 22:31:23,225 INFO o.a.j.JMeter: os.arch=amd64
2025-07-31 22:31:23,225 INFO o.a.j.JMeter: os.version=6.12.8+
2025-07-31 22:31:23,225 INFO o.a.j.JMeter: file.encoding=UTF-8
2025-07-31 22:31:23,225 INFO o.a.j.JMeter: java.awt.headless=true
2025-07-31 22:31:23,225 INFO o.a.j.JMeter: Max memory     =1073741824
2025-07-31 22:31:23,225 INFO o.a.j.JMeter: Available Processors =4
2025-07-31 22:31:23,230 INFO o.a.j.JMeter: Default Locale=English (EN)
2025-07-31 22:31:23,230 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2025-07-31 22:31:23,230 INFO o.a.j.JMeter: JMeterHome=/workspace/jmeter
2025-07-31 22:31:23,230 INFO o.a.j.JMeter: user.dir  =/workspace/jmeter-test
2025-07-31 22:31:23,230 INFO o.a.j.JMeter: PWD       =/workspace/jmeter-test
2025-07-31 22:31:23,231 INFO o.a.j.JMeter: IP: 127.0.0.1 Name: cursor FullName: localhost
2025-07-31 22:31:23,238 INFO o.a.j.s.FileServer: Default base='/workspace/jmeter-test'
2025-07-31 22:31:23,239 INFO o.a.j.s.FileServer: Set new base='/workspace/jmeter-test'
2025-07-31 22:31:23,342 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2025-07-31 22:31:23,358 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2025-07-31 22:31:23,360 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2025-07-31 22:31:23,362 INFO o.a.j.s.SaveService: Loading file: melpot_simple.jmx
2025-07-31 22:31:23,397 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-07-31 22:31:23,398 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-07-31 22:31:23,398 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-07-31 22:31:23,398 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-07-31 22:31:23,398 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2025-07-31 22:31:23,398 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2025-07-31 22:31:23,416 INFO o.a.j.JMeter: Creating summariser <summary>
2025-07-31 22:31:23,423 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2025-07-31 22:31:23,423 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-07-31 22:31:23,423 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-07-31 22:31:23,427 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2025-07-31 22:31:23,427 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2025-07-31 22:31:23,466 INFO o.a.j.JMeter: Running test (1754001083466)
2025-07-31 22:31:23,487 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : API Load Test Users
2025-07-31 22:31:23,487 INFO o.a.j.e.StandardJMeterEngine: Starting 0 threads for group API Load Test Users.
2025-07-31 22:31:23,487 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2025-07-31 22:31:23,487 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=0 ramp-up=0 delayedStart=false
2025-07-31 22:31:23,487 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2025-07-31 22:31:23,488 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2025-07-31 22:31:23,488 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2025-07-31 22:31:23,488 INFO o.a.j.r.Summariser: summary =      0 in 00:00:00 = ******/s Avg:     0 Min: 9223372036854775807 Max: -9223372036854775808 Err:     0 (0.00%)